back-end/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "teste message uashaoisjaaasjapsjas"], ["user_id", 1], ["created_at", "2021-06-21 11:43:50.694948"], ["updated_at", "2021-06-21 11:43:50.694948"]]